## Name: Rushika Sachin Landage[DST 10923]

In [ ]:
import numpy as np
import pandas as pd
import sqlite3

In [ ]:
db = 'movies.sqlite'
conn = sqlite3.connect(db)
cur = conn.cursor()

## Question 3: Check how many movies are present in IMDB.

In [ ]:
cur.execute('SELECT count(*) FROM movies')
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['movies_count'])
print('Shape of Movies_count data :',movies.shape)
movies.head()

Shape of Movies_count data : (1, 1)

   movies_count
0          4773

note: By the above generated table it is seen that there are 4773 movies present in IMDB.

## Question 4: Find these 3 directors: James Cameron ; Luc Besson ; John Woo

In [ ]:
cur.execute("select * from directors where name in ('James Cameron', 'Luc Besson', 'John Woo')")
directors = cur.fetchall()
directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
print('Shape of the 3 directors data :',directors.shape)
directors.head(3)

Shape of the 3 directors data : (3, 5)

            name    id  gender    uid department
0  James Cameron  4762       2   2710  Directing
1       John Woo  4893       2  11401  Directing
2     Luc Besson  4949       2     59  Directing

note: I have generated above table data for directors James Cameron , Luc Besson and John Woo

## Question 5: Find all directors with name starting with Steven.

In [ ]:
cur.execute("SELECT * FROM directors where name like 'steven%'")
directors = cur.fetchall()
directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
print('Shape of Directors name starting with steven data :',directors.shape)
directors.head(100)

Shape of Directors name starting with steven data : (9, 5)

                 name    id  gender    uid department
0    Steven Spielberg  4799       2    488  Directing
1   Steven Soderbergh  4909       2   1884  Directing
2        Steven Brill  5013       2  32593  Directing
3     Steven Zaillian  5117       2   2260  Directing
4        Steven Quale  5216       2  93214  Directing
5       Steven Seagal  5221       2  23880  Directing
6  Steven E. de Souza  5390       2   1726  Directing
7    Steven Shainberg  5803       2  67795  Directing
8    Steven R. Monroe  6713       2  88039  Directing

note: I have generated above table for all the directors with name starting with steven.

## Question 6: Count female directors.

In [ ]:
cur.execute("SELECT count(*) FROM directors where gender='1' ")
directors = cur.fetchall()
directors = pd.DataFrame(directors, columns = ['female_director_count'])
print('Shape of count female directors data :',directors.shape)
directors.head()

Shape of count female directors data : (1, 1)

   female_director_count
0                    150

note: I have generated above table for all the female directors count which is 150.

## Question 7: Find the name of the 10th first women directors

In [ ]:
cur.execute("SELECT * FROM directors where gender='1' order by id asc ")
directors = cur.fetchall()
directors = pd.DataFrame(directors, columns = ['name', 'id', 'gender', 'uid', 'department'])
print('Shape of Directors name starting with steven data :',directors.shape)
directors.head(10)

Shape of Directors name starting with steven data : (150, 5)

                  name    id  gender     uid department
0       Brenda Chapman  4801       1   59803  Directing
1      Lilly Wachowski  4805       1    9339  Directing
2  Jennifer Yuh Nelson  4853       1  142312  Directing
3      Kathryn Bigelow  4970       1   14392  Directing
4         Nancy Meyers  4978       1   17698  Directing
5          Jill Culton  4979       1    7881  Directing
6           Mimi Leder  4996       1   51984  Directing
7         Vicky Jenson  5032       1   12058  Directing
8         Betty Thomas  5052       1   31024  Directing
9       Angelina Jolie  5086       1   11701  Directing

note: I have generated table for first 10 women directors ordered by their id.

## Question 8: What are the 3 most popular movies?

In [ ]:
cur.execute('select id,original_title,popularity from movies order by popularity desc')
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'popularity'])
print('Shape of most popular movies data :',movies.shape)
movies.head(3)

Shape of most popular movies data : (4773, 3)

      id original_title  popularity
0  44143        Minions         875
1  43692   Interstellar         724
2  44385       Deadpool         514

note: I have generated the table for 3 most popular movies which are Minions,Interstellar,Deadpool respectively

## Question 9: What are the 3 most bankable movies?

In [ ]:
cur.execute('select id,original_title,revenue from movies order by revenue desc')
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'revenue'])
print('Shape of Movies_bank data :',movies.shape)
movies.head(3)

Shape of Movies_bank data : (4773, 3)

      id original_title     revenue
0  43597         Avatar  2787965087
1  43622        Titanic  1845034188
2  43613   The Avengers  1519557910

note: I have generated the above table having 3 most bankable movies

## Question 10: What is the most awarded average vote since the January 1st, 2000?

In [ ]:
cur.execute("SELECT id, original_title,release_date,vote_count,MAX(vote_average) FROM movies WHERE release_date >= '2000-01-01'")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'release_date', 'vote_count', 'max_vote_average'])
print('Shape of max_vote_average data :',movies.shape)
movies.head()

Shape of max_vote_average data : (1, 5)

      id original_title release_date  vote_count  max_vote_average
0  47589      Sardaarji   2015-06-26           2               9.5

note: I have generated above table for the most awarded average vote since january 1st 2000. movie name is sardaarji with the max_vote_average of 9.5 .

## Question 11: Which movie(s) were directed by Brenda Chapman?

In [ ]:
cur.execute("SELECT original_title,release_date FROM movies JOIN directors ON directors.id = movies.director_id WHERE directors.name = 'Brenda Chapman'")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['original_title', 'release_date'])
print('Shape of Movies directed by brenda chapman data :',movies.shape)
movies.head(100)

Shape of Movies directed by brenda chapman data : (1, 2)

  original_title release_date
0          Brave   2012-06-21

note: The movie name directed by brenda chapman is Brave. Released on 2012-06-21.

## Question 12: Which director made the most movies?

In [ ]:
cur.execute("SELECT name, COUNT(director_id) FROM movies JOIN directors ON directors.id = movies.director_id GROUP BY director_id ORDER BY COUNT(director_id) DESC")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['director_name', 'movies_count'])
print('Shape of Movies_count data :',movies.shape)
movies.head(1)

Shape of Movies_count data : (2349, 2)

      director_name  movies_count
0  Steven Spielberg            27

note: I have generated above table for the director who made the most movies. Ranking Director Steven spielberg at first position having movies_count 27.

## Question 13: Whose director is the most bankable?

In [ ]:
cur.execute("SELECT name, SUM(revenue) FROM movies JOIN directors ON directors.id = movies.director_id GROUP BY director_id ORDER BY SUM(revenue) DESC")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['director_name', 'movies_bank'])
print('Shape of Movies_bank data :',movies.shape)
movies.head(1)

Shape of Movies_bank data : (2349, 2)

      director_name  movies_bank
0  Steven Spielberg   9147393164

note: I have generated the table for the director who is most bankable. steven spielberg is the most bankable

## Budget Analysis
## Question - List out Top 10 highest budget made movies

In [ ]:
cur.execute("select id,original_title,budget from movies order by budget desc")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id','movie_name', 'budget'])
print('Shape of highest budget movies data :',movies.shape)
movies.head(10)

Shape of highest budget movies data : (4773, 3)

      id                                   movie_name     budget
0  43614  Pirates of the Caribbean: On Stranger Tides  380000000
1  43598     Pirates of the Caribbean: At World's End  300000000
2  43604                      Avengers: Age of Ultron  280000000
3  43607                             Superman Returns  270000000
4  43601                                  John Carter  260000000
5  43603                                      Tangled  260000000
6  43602                                 Spider-Man 3  258000000
7  43610                              The Lone Ranger  255000000
8  43600                        The Dark Knight Rises  250000000
9  43605       Harry Potter and the Half-Blood Prince  250000000

note: I have generated the above table to list out top 10 highest budget movies.

## Popularity Analysis
Question- List out Top 10 popularity on movies

In [ ]:
cur.execute("select id,original_title,popularity from movies order by popularity desc")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id','movie_name', 'popularity'])
print('Shape of Movies_popularity data :',movies.shape)
movies.head(10)

Shape of Movies_popularity data : (4773, 3)

      id                                         movie_name  popularity
0  44143                                            Minions         875
1  43692                                       Interstellar         724
2  44385                                           Deadpool         514
3  43691                            Guardians of the Galaxy         481
4  43724                                 Mad Max: Fury Road         434
5  43625                                     Jurassic World         418
6  43796  Pirates of the Caribbean: The Curse of the Bla...         271
7  43679                     Dawn of the Planet of the Apes         243
8  43797              The Hunger Games: Mockingjay - Part 1         206
9  43685                                         Big Hero 6         203

note: I have generated the table for 10 most popular movies.

## Revenue Analysis
## Question - What are the top 10 Revenue movies

In [ ]:
cur.execute('select id,original_title,revenue from movies order by revenue desc')
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title', 'revenue'])
print('Shape of top_revenue data :',movies.shape)
movies.head(10)

Shape of top_revenue data : (4773, 3)

      id              original_title     revenue
0  43597                      Avatar  2787965087
1  43622                     Titanic  1845034188
2  43613                The Avengers  1519557910
3  43625              Jurassic World  1513528810
4  43641                   Furious 7  1506249360
5  43604     Avengers: Age of Ultron  1405403694
6  43721                      Frozen  1274219009
7  43628                  Iron Man 3  1215439994
8  44143                     Minions  1156730962
9  43623  Captain America: Civil War  1153304495

note: I have generated table for top 10 revenue movies

## Voting Analysis
## Question - Display most popular movies with vote_average

In [ ]:
cur.execute("SELECT id, original_title,vote_average FROM movies order by vote_average desc")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['id', 'original_title','vote_average'])
print('Shape of vote_average data :',movies.shape)
movies.head(10)

Shape of vote_average data : (4773, 3)

      id            original_title  vote_average
0  47116          Stiff Upper Lips          10.0
1  47642     Dancer, Texas Pop. 81          10.0
2  47589                 Sardaarji           9.5
3  45983            One Man's Hero           9.3
4  45478  The Shawshank Redemption           8.5
5  46567        There Goes My Baby           8.5
6  46393     The Prisoner of Zenda           8.4
7  46934             The Godfather           8.4
8  44259                Fight Club           8.3
9  45415          Schindler's List           8.3

note: I have generated the table for most popular movies by vote average

## Question - List out Particular movie for Voting average and votecount

In [ ]:
cur.execute("SELECT title, vote_average, vote_count FROM movies WHERE title = 'Your Movie Title'")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['original_title','vote_average','vote_count'])
print('Shape of movie data :',movies.shape)
movies.head(1)

Shape of movie data : (0, 3)

Empty DataFrame
Columns: [original_title, vote_average, vote_count]
Index: []

note: Here's the code to list a particular movie along with its voting average and vote count. Just Replace 'Your Movie Title' with the title of the specific movie you want to retrieve information for.

## Directors Analysis
## Question- List out the director names with number of movies and revenue

In [ ]:
cur.execute("SELECT name, COUNT(director_id),revenue FROM movies JOIN directors ON directors.id = movies.director_id GROUP BY director_id ORDER BY COUNT(director_id)")
movies = cur.fetchall()
movies = pd.DataFrame(movies, columns = ['director_name', 'movies_count','revenue'])
print('Shape of Movies_count data :',movies.shape)
movies.head(4773)

Shape of Movies_count data : (2349, 3)

         director_name  movies_count     revenue
0         Byron Howard             1   591794936
1          Dan Scanlon             1   743559607
2          Lee Unkrich             1  1066969703
3           Peter Sohn             1   331926147
4       Brenda Chapman             1   538983207
...                ...           ...         ...
2344         Spike Lee            16   184376254
2345   Martin Scorsese            20   185770160
2346    Clint Eastwood            20   128884132
2347       Woody Allen            21   151119219
2348  Steven Spielberg            27   786636033

[2349 rows x 3 columns]

note: I have generated the table for directors with their movie count and revenue.